content/posts/lecun_cake_analogy.md
+++
title = "LeCun's Cake Analogy"
author = ["Jethro Kuan"]
lastmod = 2020-07-08T14:55:04+08:00
draft = false
+++

## Backlinks {#backlinks}

- [Self-supervised Learning]({{< relref "self_supervised_learning" >}})

Yann LeCun gave this cake analogy in NIPS 2016:

If we think of our brain as a cake, then the cake base is unsupervised
learning. The machine predicts any part of its input for any observed
part (e.g. future frames in videos), all without the use of labelled
data. Supervised learning forms the icing on the cake, and
reinforcement learning is the cherry on top.

In NIPS 2017, Pieter Abbeel reused this cake analogy to describe his paper
[Hindsight Experience Replay]({{< relref "andrychowicz2017_hindsight_experience_replay" >}}): "Intelligence is a cake with many cherries"
